const jokes = [
  '𝐖ʜʏ ᴅɪᴅ ᴛʜᴇ ᴘʀᴏɢʀᴀᴍᴍᴇʀ ǫᴜɪᴛ ᴛʜᴇ ᴊᴏʙ? Bᴇᴄᴀᴜsᴇ ᴛʜᴇʏ ᴅɪᴅɴ’ᴛ ɢᴇᴛ ᴀʀʀᴀʏs.',
  '𝐖ʜᴀᴛ ᴅᴏ ʏᴏᴜ ᴄᴀʟʟ 8 ʜᴏʙʙɪᴛs? A ʜᴏʙʙɪᴛ.',
  '𝐖ʜʏ ᴅᴏ ᴘʀᴏɢʀᴀᴍᴍᴇʀs ᴘʀᴇғᴇʀ ᴅᴀʀᴋ ᴍᴏᴅᴇ? Bᴇᴄᴀᴜsᴇ ʟɪɢʜᴛ ᴀᴛᴛʀᴀᴄᴛs ʙᴜɢs.',
  '𝐈 ᴛᴏʟᴅ ᴍʏ ᴄᴏᴍᴘᴜᴛᴇʀ ɪ ɴᴇᴇᴅᴇᴅ ᴀ ʙʀᴇᴀᴋ. Nᴏᴡ ɪᴛ ᴡᴏɴ’ᴛ sᴛᴏᴘ sᴇɴᴅɪɴɢ ᴍᴇ ᴘᴏᴘ-ᴜᴘs.',
  '𝐖ʜᴀᴛ’s ᴀ ᴘʀᴏɢʀᴀᴍᴍᴇʀ’s ғᴀᴠᴏᴜʀɪᴛᴇ ᴘʟᴀᴄᴇ ᴛᴏ ʜᴀɴɢ ᴏᴜᴛ? Tʜᴇ ᴄᴏᴅᴇ ʙᴀʀ.',
]

module.exports = {
  name: 'joke',
  desc: 'Tell a random clean joke',
  async run({ reply }) {
    return reply(`> 𝐀 ʟɪᴛᴛʟᴇ ʜᴜᴍᴏᴜʀ ғᴏʀ ʏᴏᴜ:\n\n${jokes[Math.floor(Math.random() * jokes.length)]}`)
  },
}
